In [73]:
import seaborn as sns
import pandas as pd
import math

In [74]:
titanic = sns.load_dataset("titanic")

In [75]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [76]:
titanic.shape

(891, 15)

In [77]:
len(titanic)

891

In [78]:
def print_head(dataset, db_name, t_name):
    columns = dataset.columns
    result = "INSERT INTO `"+db_name+"`.`"+t_name+"` (`id`, "
    i = 1
    for c in columns:
        result += "`"+str(c)+"`"
        if i < len(columns):
            result += ", "
        i+=1
    result += ") \nVALUES \n"
    return result

    #INSERT INTO `titanic`.`titanic` (`survived`, `pclass`, `sex`, `age`, `sibsp`, `parch`, `fare`, `embarked`, `class`, `who`, `adult_male`, `deck`, `embark_town`, `alive`, `alone`) VALUES ('klj', 'hkl', 'jhk', 'ljh', 'kljh', 'lkjh', 'lkjh', 'kljh', 'klj', 'hkl', 'jh', 'kljhl', 'kjh', 'lkjh', 'kj');

In [79]:
def print_row(index, r, columns, last):
    result = ""
    result += "("+str(index)+", "
    i = 1
    for c in columns:
        dato = ''
        if isinstance(r[c], str):
            dato = "'"+str(r[c])+"'"
        elif isinstance(r[c], bool):
            dato = str(r[c])
        elif isinstance(r[c], int) or isinstance(r[c], float):
            if math.isnan(r[c]):
                dato = 'NULL'
            else:
                dato = str(r[c])
        else:
            dato = "----------------------"
        result += dato
        if i < len(columns): # si es el Ãºltimo
            result += ", "
        i += 1
    
    if last:
        result += ");"
    else:
        result += "), \n"
    
    return result

In [80]:
def print_values(dataset):
    columns = dataset.columns
    result = ""
    for i, fila in dataset.iterrows():
        last = i+1 == len(dataset)
        result += print_row(i, fila, columns, last)
    return result

In [81]:
def to_sql_insert(dataset, name):
    result = print_head(dataset, name, name)
    result += print_values(dataset)
    return result

In [82]:
file = open("titanic_insert.sql","w")
file.write(to_sql_insert(titanic, 'titanic'))
file.close()

In [51]:
type(titanic.sex[0])

str

In [87]:
titanic.fare[20:30]

20     26.0000
21     13.0000
22      8.0292
23     35.5000
24     21.0750
25     31.3875
26      7.2250
27    263.0000
28      7.8792
29      7.8958
Name: fare, dtype: float64

In [88]:
titanic.fare.max()

512.3292

In [89]:
len(titanic)

891